test/wrk2/media_microservice/output_register-user.log
Running 30s test @ http://130.127.133.219:30081
  5 threads and 5 connections
  Thread calibration: mean lat.: 2096.852ms, rate sampling interval: 8568ms
  Thread calibration: mean lat.: 2079.323ms, rate sampling interval: 8544ms
  Thread calibration: mean lat.: 2080.330ms, rate sampling interval: 8544ms
  Thread calibration: mean lat.: 2079.063ms, rate sampling interval: 8560ms
  Thread calibration: mean lat.: 2081.143ms, rate sampling interval: 8552ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.37s     2.99s   14.11s    60.98%
    Req/Sec    42.10      1.14    44.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.52s 
 75.000%   12.24s 
 90.000%   13.03s 
 99.000%   14.05s 
 99.900%   14.10s 
 99.990%   14.11s 
 99.999%   14.11s 
100.000%   14.11s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4575.231     0.000000            4         1.00
    5029.887     0.100000          422         1.11
    6721.535     0.200000          843         1.25
    7192.575     0.300000         1261         1.43
    7749.631     0.400000         1680         1.67
    9519.103     0.500000         2099         2.00
    9814.015     0.550000         2312         2.22
   10256.383     0.600000         2519         2.50
   11845.631     0.650000         2729         2.86
   12091.391     0.700000         2946         3.33
   12238.847     0.750000         3156         4.00
   12312.575     0.775000         3263         4.44
   12394.495     0.800000         3364         5.00
   12468.223     0.825000         3474         5.71
   12541.951     0.850000         3574         6.67
   12615.679     0.875000         3678         8.00
   12656.639     0.887500         3731         8.89
   13025.279     0.900000         3779        10.00
   13778.943     0.912500         3831        11.43
   13893.631     0.925000         3894        13.33
   13918.207     0.937500         3937        16.00
   13934.591     0.943750         3966        17.78
   13959.167     0.950000         4002        20.00
   13967.359     0.956250         4017        22.86
   13983.743     0.962500         4042        26.67
   14000.127     0.968750         4071        32.00
   14008.319     0.971875         4086        35.56
   14016.511     0.975000         4101        40.00
   14024.703     0.978125         4116        45.71
   14032.895     0.981250         4133        53.33
   14032.895     0.984375         4133        64.00
   14041.087     0.985938         4147        71.11
   14041.087     0.987500         4147        80.00
   14049.279     0.989062         4160        91.43
   14049.279     0.990625         4160       106.67
   14057.471     0.992188         4168       128.00
   14065.663     0.992969         4173       142.22
   14065.663     0.993750         4173       160.00
   14073.855     0.994531         4185       182.86
   14073.855     0.995313         4185       213.33
   14073.855     0.996094         4185       256.00
   14073.855     0.996484         4185       284.44
   14073.855     0.996875         4185       320.00
   14082.047     0.997266         4189       365.71
   14082.047     0.997656         4189       426.67
   14090.239     0.998047         4192       512.00
   14090.239     0.998242         4192       568.89
   14090.239     0.998437         4192       640.00
   14098.431     0.998633         4194       731.43
   14098.431     0.998828         4194       853.33
   14098.431     0.999023         4194      1024.00
   14106.623     0.999121         4197      1137.78
   14106.623     0.999219         4197      1280.00
   14106.623     0.999316         4197      1462.86
   14106.623     0.999414         4197      1706.67
   14106.623     0.999512         4197      2048.00
   14106.623     0.999561         4197      2275.56
   14106.623     0.999609         4197      2560.00
   14106.623     0.999658         4197      2925.71
   14106.623     0.999707         4197      3413.33
   14106.623     0.999756         4197      4096.00
   14114.815     0.999780         4198      4551.11
   14114.815     1.000000         4198          inf
#[Mean    =     9368.892, StdDeviation   =     2990.130]
#[Max     =    14106.624, Total count    =         4198]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------

  Latency Distribution (HdrHistogram - Uncorrected Latency (measured without taking delayed starts into account))
 50.000%   15.81ms
 75.000%   17.28ms
 90.000%   29.87ms
 99.000%  100.80ms
 99.900%  197.25ms
 99.990%  198.65ms
 99.999%  198.65ms
100.000%  198.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       8.591     0.000000            1         1.00
      13.239     0.100000          421         1.11
      14.183     0.200000          840         1.25
      14.847     0.300000         1262         1.43
      15.343     0.400000         1685         1.67
      15.807     0.500000         2105         2.00
      16.047     0.550000         2318         2.22
      16.247     0.600000         2525         2.50
      16.511     0.650000         2730         2.86
      16.831     0.700000         2942         3.33
      17.279     0.750000         3149         4.00
      17.567     0.775000         3255         4.44
      17.903     0.800000         3359         5.00
      18.383     0.825000         3464         5.71
      19.583     0.850000         3569         6.67
      24.847     0.875000         3674         8.00
      27.215     0.887500         3726         8.89
      29.887     0.900000         3779        10.00
      34.527     0.912500         3831        11.43
      47.167     0.925000         3884        13.33
      78.463     0.937500         3937        16.00
      81.599     0.943750         3962        17.78
      96.127     0.950000         3989        20.00
      97.087     0.956250         4015        22.86
      97.855     0.962500         4042        26.67
      98.367     0.968750         4069        32.00
      98.559     0.971875         4081        35.56
      98.815     0.975000         4094        40.00
      99.199     0.978125         4110        45.71
      99.647     0.981250         4121        53.33
      99.967     0.984375         4133        64.00
     100.223     0.985938         4140        71.11
     100.543     0.987500         4150        80.00
     100.671     0.989062         4154        91.43
     101.119     0.990625         4159       106.67
     104.575     0.992188         4166       128.00
     107.775     0.992969         4169       142.22
     121.343     0.993750         4172       160.00
     125.695     0.994531         4176       182.86
     126.783     0.995313         4179       213.33
     177.791     0.996094         4182       256.00
     178.559     0.996484         4184       284.44
     180.607     0.996875         4185       320.00
     195.711     0.997266         4187       365.71
     196.095     0.997656         4189       426.67
     196.351     0.998047         4190       512.00
     196.607     0.998242         4191       568.89
     196.863     0.998437         4192       640.00
     197.119     0.998633         4193       731.43
     197.247     0.998828         4194       853.33
     197.247     0.999023         4194      1024.00
     197.503     0.999121         4195      1137.78
     197.503     0.999219         4195      1280.00
     198.271     0.999316         4197      1462.86
     198.271     0.999414         4197      1706.67
     198.271     0.999512         4197      2048.00
     198.271     0.999561         4197      2275.56
     198.271     0.999609         4197      2560.00
     198.271     0.999658         4197      2925.71
     198.271     0.999707         4197      3413.33
     198.271     0.999756         4197      4096.00
     198.655     0.999780         4198      4551.11
     198.655     1.000000         4198          inf
#[Mean    =       22.411, StdDeviation   =       22.816]
#[Max     =      198.528, Total count    =         4198]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6375 requests in 30.01s, 1.76MB read
Requests/sec:    212.45
Transfer/sec:     60.20KB